emacs/.config/emacs/post-init.org
#+TITLE: Emacs Initialization
#+AUTHOR: Glen Larsen
#+DESCRIPTION: Emacs init file literate program document.
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Emacs Initialization

This is a literate program that documents my emacs initialization and renders
the actual initialization files.
[[https://github.com/jamescherti/minimal-emacs.d][Minimal-emacs]] is used as a
framework which dictates the following files to complete a local initialization,

Use =C-c C-v t= to render the output file.

** post-init.el

#+begin_src emacs-lisp :comments no :tangle post-init.el
;; post-init.el --- Loaded after init -*- no-byte-compile: t; lexical-binding: t; -*-
;; WARNING: This file was generated by tangling a literate program.
;;          Do not edit this file, edit the source (emacs-init.org)!
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (add-to-list 'load-path (expand-file-name "site-lisp/" minimal-emacs-user-directory))
#+end_src

*** Compile angel

This package will byte compile all elisp files except for your exclusions. It
should be located before all other packages.

#+begin_src emacs-lisp :tangle post-init.el
(use-package compile-angel
  :ensure t
  :demand t
  :custom
  ;; Set `compile-angel-verbose` to nil to suppress output from compile-angel.
  ;; Drawback: The minibuffer will not display compile-angel's actions.
  (compile-angel-verbose nil)
  :config
  ;; The following directive prevents compile-angel from compiling your init
  ;; files. If you choose to remove this push to `compile-angel-excluded-files'
  ;; and compile your pre/post-init files, ensure you understand the
  ;; implications and thoroughly test your code. For example, if you're using
  ;; `use-package', you'll need to explicitly add `(require 'use-package)` at
  ;; the top of your init file.
  (push "/pre-init.el" compile-angel-excluded-files)
  (push "/post-init.el" compile-angel-excluded-files)
  (push "/pre-early-init.el" compile-angel-excluded-files)
  (push "/post-early-init.el" compile-angel-excluded-files)

  ;; A local mode that compiles .el files whenever the user saves them.
  ;; (add-hook 'emacs-lisp-mode-hook #'compile-angel-on-save-local-mode)

  ;; A global mode that compiles .el files before they are loaded.
  (compile-angel-on-load-mode))
#+end_src

*** Starting a server, keychain environment

#+begin_src emacs-lisp :tangle post-init.el
(require 'server)
(unless (server-running-p) (server-start))
#+end_src

#+begin_src emacs-src :tangle post-init.el
  (defalias 'view-emacs-news 'ignore)
  (defalias 'describe-gnu-project 'ignore)
  (use-package keychain-environment
  :config
  (keychain-refresh-environment))
#+end_src

*** App launcher

#+begin_src emacs-lisp
  (use-package xdg-launcher
    :straight '(xdg-launcher :host github :repo "emacs-exwm/xdg-launcher")
    )
#+end_src

*** Org mode

We use ~org-mode~ for taking notes.

#+begin_src emacs-lisp :tangle post-init.el
  ;; org mode
  (use-package org
    :ensure t
    :defer t
    :commands (org-mode org-version)
    :init
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (latex . t)
       (sql . t)
       (lisp . t)))
    (font-lock-add-keywords 'org-mode
                            '(("^ +\\([-*]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
    :mode
    ("\\.org\\'" . org-mode)
    :hook
    (org-mode . visual-line-mode)
    :config
    (add-to-list 'org-structure-template-alist
                 '("b" . "abstract"))
    (setq org-src-fontify-natively t
          org-hide-emphasis-markers t
          org-src-1tab-acts-natively t)
    (setq org-capture-templates
          '(("n" "Notes"
             entry (file+headline "notes.org" "Notes")
             "- %?\n %U")
            )))
  ;; addition key definitions for org
  (keymap-global-set "C-c l" 'org-store-link)
  (keymap-global-set "C-c c" 'org-capture)
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (use-package org-bullets
    :hook
    (org-mode . org-bullets-mode))
#+end_src

This package shows hidden elements interactively when the cursor enters the
word.
#+begin_src emacs-lisp :tangle post-init.el
  (use-package org-appear
    :commands (org-appear-mode)
    :hook
    (org-mode . org-appear-mode)
    :config
    (setq org-appear-autoemphasis t
          org-appear-autolinks t
          org-appear-autosubmarkers t))
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (use-package toc-org
    :hook ((org-mode . toc-org-mode)))
#+end_src

*** Pikchr mode
#+begin_src emacs-lisp :tangle post-init.el
  (use-package pikchr-mode
    :config
    (require 'xml))
#+end_src

*** Version control

We use fossil for personal projects.

#+begin_src emacs-lisp :tangle post-init.el
  (use-package vc-fossil)
#+end_src

*** Markdown mode

#+begin_src emacs-lisp :tangle post-init.el
  (use-package markdown-mode
    :hook ((markdown-mode . visual-line-mode)))
#+end_src

*** AsciiDoc mode
#+begin_src emacs-lisp :tangle post-init.el
  (use-package adoc-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist (cons "\\.adoc\\'" 'adoc-mode)))
#+end_src
*** Save place, Recent files

Note that ~save-place~ is inhibited when running emacs as a daemon.

#+begin_src emacs-lisp :tangle post-init.el
  (add-hook 'after-init-hook #'save-place-mode)
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (add-hook 'after-init-hook #'(lambda()
                                 (let ((inhibit-message t))
                                   (recentf-mode 1))))
  (add-hook 'kill-emacs-hook #'recentf-cleanup)
#+end_src

*** White space cleanup, parentheses handling

A few details for whitespace cleanup and some help for keeping a matching set
of parentheses.

#+begin_src emacs-lisp :tangle post-init.el
  (add-hook 'before-save-hook 'whitespace-cleanup)
  (setq show-paren-delay 0)
  (show-paren-mode t)
  (electric-pair-mode t)
  ;(setq show-paren-style 'mixed)     ;mixed, parenthesis, expression
  (setq show-paren-style 'expression)

  (use-package rainbow-delimiters
    :hook ((prog-mode . rainbow-delimiters-mode)))
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (use-package paredit
    :hook
    ((emacs-lisp-mode . paredit-mode)
     ;(elm-mode . paredit-mode)
     ;(haskell-mode . paredit-mode)
     (lisp-mode . paredit-mode)
     (lisp-interactive . paredit-mode)))
#+end_src

Smartparens is a little strong for me.

#+begin_src emacs-lisp :tangle no
  (use-package smartparens
    :hook (prog-mode text-mode markdown-mode)
    :config
    (require 'smartparens-config)
    (custom-set-variables
     '(sp-base-key-bindings 'sp)
     '(sp-override-key-bindings
       '(("C-S-<left>" . sp-backward-slurp-sexp)
         ("C-S-<right>" . sp-backward-barf-sexp)
         ("C-(" . sp-rewrap-sexp)))))
#+end_src

*** Dired mode

Directory editing a little special treatment with icons and a wimpy mechanism
to try to minimize the number of buffers created.

#+begin_src emacs-lisp :tangle post-init.el
  (defun my-dired-mode-hook ()
    (put 'dired-find-alternate-file 'disabled nil) ; Disables the warning.
    (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)
    (define-key dired-mode-map (kbd "^") 'dired-up-directory-same-buffer))

  (setq dired-use-ls-dired nil
        dired-listing-switches "-alh --group-directories-first -t -o --time-style=long-iso")
  (setq dired-use-ls-dired nil)
  (keymap-global-set "C-x C-d" 'dired)
#+end_src

*** Spell check

This sometimes drives me crazy but ... not a bad idea.

#+begin_src emacs-lisp :tangle post-init.el
  (use-package ispell
    :ensure nil
    :defer t
    :commands (ispell ispell-minor-mode)
    :custom
    ;; Set the ispell program name to aspell
    (ispell-program-name "aspell")

    ;; Configures Aspell's suggestion mode to "ultra", which provides more
    ;; aggressive and detailed suggestions for misspelled words. The language
    ;; is set to "en_US" for US English, which can be replaced with your desired
    ;; language code (e.g., "en_GB" for British English, "de_DE" for German).
    (ispell-extra-args '("--sug-mode=ultra" "--lang=en_US")))
#+end_src

