emacs/.config/emacs/post-init.org
*** Theming

#+begin_src emacs-lisp :tangle post-init.el
  (setq modus-themes-mode-line '(accented borderless)
        modus-themes-italic-constructs t
        modus-themes-fringes 'subtle
        modus-themes-tabs-accented t
        modus-themes-paren-math '(bold intense)
        modus-themes-prompts '(bold intense)
        modus-themes-scale-headings t
        modus-themes-region '(bg-only)
        modus-themes-headings
        '((1 . (rainbow overline background 1.4))
          (2 . (rainbow background 1.3))
          (3 . (rainbow bold 12))
          (t . (semilight 1.1))))
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (use-package modus-themes
    :init
    (load-theme 'modus-vivendi t)
    ;;(load-theme 'modus-operandi-tinted t)
    :config
    (set-face-attribute 'default nil
        :font "Fira Code Retina"
        :height 100)
    (set-face-attribute 'fixed-pitch nil
        :font "Fira Code Retina"
        :height 100)
    (set-face-attribute 'variable-pitch nil
        :font "Cantarell"
        :height 100
        :weight 'regular)
    )
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  ;; Enable the www ligature in every possible major mode
  (use-package ligature
    :config
    (ligature-set-ligatures 't '("www"))
    (global-ligature-mode 't)
    ;; Enable ligatures in programming modes
    (ligature-set-ligatures
     '(prog-mode adoc-mode org-mode)
     '("www" ":=" "!!" "!=" "!==" "-}"
       "----" "-->" "->" "->>" "-<" "-<<" "-~"
       "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
       "#_(" ".-" ".=" ".." "..<" "..." "?=" "??"
       ";;" "/*" "/**" "/=" "/==" "/>" "//" "///"
       "&&" "||" "||=" "|=" "|>" "^=" "$>" "++"
       "+++" "+>" "=:=" "==>" "=>"
       "=>>" "<=" "=<<" "=/=" ">-" ">=" ">=>"
       ">>" ">>-" ">>=" ">>>" "<*" "<*>" "<|"
       "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->"
       "<+" "<+>" "<=" "<==" "<=>" "<=<" "<>"
       "<<" "<<-" "<<=" "<<<" "<~" "<~~" "</"
       "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
    )
#+end_src

*** Autosave activation

Enable ~auto-save-mode~ to prevent data loss. Use ~recover-file~ or
~recover-session~ to restore unsaved changes.

#+begin_src emacs-lisp :tangle post-init.el
  (setq auto-save-default t
        auto-save-interval 300
        auto-save-timeout 30)
#+end_src

*** Code folding

I may use this in the future.

#+begin_src emacs-lisp :tangle no
  (use-package outline-indent
    :ensure t
    :defer t
    :commands outline-indent-minor-mode
    :custom
    (outline-indent-ellipsis " ▼")
    :init
    ;; The minor mode can also be automatically activated for a certain modes.
    (add-hook 'python-mode-hook #'outline-indent-minor-mode)
    (add-hook 'python-ts-mode-hook #'outline-indent-minor-mode))
#+end_src

*** Utf-8 coding system

#+begin_src emacs-lisp :tangle post-init.el
  (set-locale-environment "en_US.UTF-8")
  (set-default-coding-systems 'utf-8)
#+end_src

*** TCL

TCL mode.

#+begin_src emacs-lisp :tangle post-init.el
  ;; Treat modules as tcl files.
  (add-to-list 'auto-mode-alist '("\\.tm\\'" . tcl-mode))
#+end_src

*** Lilypond music typesetting.

#+begin_src emacs-lisp :tangle post-init.el
    ;;; lilypond
  (autoload 'LilyPond-mode "lilypond-mode" "LilyPond Editing Mode" t)
  (add-to-list 'auto-mode-alist '("\\.ly\\'" . LilyPond-mode))
  (add-to-list 'auto-mode-alist '("\\.ily\\'" . LilyPond-mode))
  ;; (add-hook 'LilyPond-mode-hook (lambda () (turn-on-font-lock)))
#+end_src

*** Auto insertion

#+begin_src emacs-lisp :tangle post-init.el
  (use-package yasnippet
    :ensure t
    :bind ("C-c y" . yas-expand)
    :config
    (define-key yas-minor-mode-map (kbd "<tab>") nil)
    (define-key yas-minor-mode-map (kbd "TAB") nil)
    (yas-global-mode))
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (setq auto-insert-directory "~/.config/emacs/templates/"
        auto-insert-mode t
        auto-insert-query nil
        auto-insert-alist
          '((python-mode . "python.template")
            (sh-mode     . "sh.template")
            (tcl-mode    . "tcl.template")))
  (add-hook 'find-file-hook 'auto-insert)
#+end_src

I've removed this hook because it didn't play nice with denote.
#+begin_src emacs-lisp :tangle no
          (org-mode    . "org.template")
#+end_src

*** Helpful

#+begin_src emacs-lisp :tangle post-init.el
  (use-package helpful
    :defer t
    :commands (helpful-callable
               helpful-variable
               helpful-key
               helpful-command
               helpful-at-point
               helpful-function)
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-function] . helpful-callable)
    ([remap describe-key] . helpful-key)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    :custom
    (helpful-max-buffers 7))
#+end_src

*** Vertico, orderless, savehist

[[https://github.com/minad/vertico][Vertico]] is a completion UI which behaves correctly and is fully compatible
with built-in Emacs completion.

#+begin_src emacs-lisp :tangle no
  (use-package vertico
    :ensure t
    :bind (:map vertico-map
                ("C-j" . vertico-next)
                ("C-k" . vertico-previous)
                ("<return>" . vertico-exit)
                :map minibuffer-local-map
                ("M-h" . backward-kill-word))
    :custom
    (vertico-count 20)
    (vertico-cycle t)
    :init
    (vertico-mode))
#+end_src

It has been recommended to use savehist with vertico.

#+begin_src emacs-lisp :tangle no
  (setq history-length 25)
  (savehist-mode 1)
#+end_src

[[https://github.com/minad/marginalia][Marginalia]] supplies annotations to completion candidates.

#+begin_src emacs-lisp :tangle no
  (use-package marginalia
    :after vertico
    :ensure t
    :commands (marginalia-mode marginalia-cycle)
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy
                             marginalia-annotators-light
                             nil))
    :init
    (marginalia-mode))
#+end_src

[[https://github.com/oantolin/orderless][Orderless]] is an interesting matching package. To match, it separates the
target into space-separated components and matches candidates that match all
of the candidates in any order.

#+begin_src emacs-lisp :tangle no
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

*** Copy as format, abbreviations

Copy as format will capture a piece of code, and wrap it with the appropriate
syntax for display on the target.

#+begin_src emacs-lisp :tangle post-init.el
  (use-package copy-as-format
    :ensure t
    :defer t
    :bind
    (("C-c w a" . copy-as-format-asciidoc)
     ("C-c w g" . copy-as-format-github)
     ("C-c w m" . copy-as-format-markdown)
     ("C-c w o" . copy-as-format-org-mode)
     ))
#+end_src

#+begin_src emacs-lisp :tangle no
(setq abbrev-file-name (concat user-emacs-directory "abbrev_defs.el"))
(setq-default abbrev-mode t)
(add-hook 'rst-mode-hook #'abbrev-mode)
#+end_src

*** Doom mode-line

For more info, see the [[https://github.com/seagle0128/doom-modeline][Doom mode line]] git hub page.
#+begin_src emacs-lisp :tangle post-init.el
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))
#+end_src

Nerd icons are just sugar. Why have a cool mode-line without some sugar?
#+begin_src emacs-lisp :tangle post-init.el
  (use-package nerd-icons)
#+end_src

*** Slime or Sly

#+begin_src emacs-lisp :tangle post-init.el
  (use-package sly
    :config
    (setq inferior-lisp-program "sbcl"))
#+end_src

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package slime
    :config
    (setq inferior-lisp-program "sbcl")
    (slime-setup '(slime-fancy slime-quicklisp slime-asdf)))
  ;;(load (expand-file-name "~/quicklisp/slime-helper.el"))
#+END_SRC

*** JavaScript and TypeScript

#+begin_src emacs-lisp :tangle post-init.el
  (use-package yaml-mode)
  (use-package typescript-mode
    :config
    (setq typescript-indent-level 2
          typescript-auto-indent-flag t))

  (use-package graphql-ts-mode
    :mode ("\\.graphql\\'" "\\.gql\\'")
    :init
    (with-eval-after-load 'treesit
      (add-to-list 'treesit-language-source-alist
                   '(graphql "https://github.com/bkegley/tree-sitter-graphql")))
    )
#+end_src

#+begin_src emacs-lisp :tangle post-init.el
  (use-package js2-mode
    :config
    (setq js2-basic-offset 2))
  (use-package json-mode)
#+end_src

*** lua

#+begin_src emacs-lisp :tangle post-init.el
(use-package lua-mode
  :ensure t
  :mode "\\.lua\\'"
  :interpreter "lua"
  :config
  (setq lua-indent-level 4)) ; Change indentation depth as preferred
#+end_src


*** qml

#+begin_src emacs-lisp :tangle post-init.el
(use-package qml-mode)

#+end_src

#+begin_src emacs-lisp
(use-package qml-ts-mode
  (require 'qml-ts-mode)
  :after lsp-mode
  :config
  (add-to-list 'lsp-language-id-configuration '(qml-ts-mode . "qml-ts"))
  (lsp-register-client
   (make-lsp-client :new-connection (lsp-stdio-connection '("qmlls", "-E"))
                    :activation-fn (lsp-activate-on "qml-ts")
                    :server-id 'qmlls))
  (add-hook 'qml-ts-mode-hook (lambda ()
                                (setq-local electric-indent-chars '(?\n ?\( ?\) ?{ ?} ?\[ ?\] ?\; ?,))
                                (lsp-deferred))))
#+end_src

*** Haskell

#+begin_src emacs-lisp :tangle post-init.el
  (use-package haskell-mode
    :config
    (require 'hs-lint)
    (setq haskell-process-type 'cabal-repl
          haskell-literate 'tex
          haskell-process-suggest-remove-import-lines t
          haskell-stylish-on-save t)
    :hook
    ( ;; (haskell-mode . turn-on-haskell-indentation)
     (haskell-mode . haskell-indentation-mode)
     (haskell-mode . interactive-haskell-mode)
     (haskell-mode . eglot-ensure))
    :bind (:map haskell-mode-map
                ("C-c a c" . haskel-cabal-visit-file)
                ("C-c a i" . haskell-navigate-imports)
                ("C-c a l" . hs-lint)
                ("C-c m" . haskell-compile)
                :map haskell-cabal-mode-map
                ("C-c m" . haskell-compile)))
#+end_src


#+begin_src emacs-lisp :tangle no
  (use-package hindent
    :hook
    ((haskell-mode . hindent-mode)))
#+end_src

*** Tree-sitter

;; +begin_src emacs-lisp :tangle post-init.el
#+begin_src emacs-lisp :tangle no
  (use-package tree-sitter
    :hook ((haskell-mode . tree-sitter-hl-mode)
           (elm-mode . tree-sitter-hl-mode))
    )
  ;; (use-package tree-sitter-langs)
#+end_src


#+begin_src emacs-lisp :tangle post-init.el
  (use-package lsp-haskell
    :config
    (setq lsp-haskell-server-path "haskell-language-server-wrapper"))
#+end_src

