emacs/.config/emacs/post-init.el

(setq modus-themes-mode-line '(accented borderless)
      modus-themes-italic-constructs t
      modus-themes-fringes 'subtle
      modus-themes-tabs-accented t
      modus-themes-paren-math '(bold intense)
      modus-themes-prompts '(bold intense)
      modus-themes-scale-headings t
      modus-themes-region '(bg-only)
      modus-themes-headings
      '((1 . (rainbow overline background 1.4))
        (2 . (rainbow background 1.3))
        (3 . (rainbow bold 12))
        (t . (semilight 1.1))))

(use-package modus-themes
  :init
  (load-theme 'modus-vivendi t)
  ;;(load-theme 'modus-operandi-tinted t)
  :config
  (set-face-attribute 'default nil
      :font "Fira Code Retina"
      :height 100)
  (set-face-attribute 'fixed-pitch nil
      :font "Fira Code Retina"
      :height 100)
  (set-face-attribute 'variable-pitch nil
      :font "Cantarell"
      :height 100
      :weight 'regular)
  )

;; Enable the www ligature in every possible major mode
(use-package ligature
  :config
  (ligature-set-ligatures 't '("www"))
  (global-ligature-mode 't)
  ;; Enable ligatures in programming modes
  (ligature-set-ligatures
   '(prog-mode adoc-mode org-mode)
   '("www" ":=" "!!" "!=" "!==" "-}"
     "----" "-->" "->" "->>" "-<" "-<<" "-~"
     "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
     "#_(" ".-" ".=" ".." "..<" "..." "?=" "??"
     ";;" "/*" "/**" "/=" "/==" "/>" "//" "///"
     "&&" "||" "||=" "|=" "|>" "^=" "$>" "++"
     "+++" "+>" "=:=" "==>" "=>"
     "=>>" "<=" "=<<" "=/=" ">-" ">=" ">=>"
     ">>" ">>-" ">>=" ">>>" "<*" "<*>" "<|"
     "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->"
     "<+" "<+>" "<=" "<==" "<=>" "<=<" "<>"
     "<<" "<<-" "<<=" "<<<" "<~" "<~~" "</"
     "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
  )

(setq auto-save-default t
      auto-save-interval 300
      auto-save-timeout 30)

(set-locale-environment "en_US.UTF-8")
(set-default-coding-systems 'utf-8)

;; Treat modules as tcl files.
(add-to-list 'auto-mode-alist '("\\.tm\\'" . tcl-mode))

;;; lilypond
(autoload 'LilyPond-mode "lilypond-mode" "LilyPond Editing Mode" t)
(add-to-list 'auto-mode-alist '("\\.ly\\'" . LilyPond-mode))
(add-to-list 'auto-mode-alist '("\\.ily\\'" . LilyPond-mode))
;; (add-hook 'LilyPond-mode-hook (lambda () (turn-on-font-lock)))

(use-package yasnippet
  :ensure t
  :bind ("C-c y" . yas-expand)
  :config
  (define-key yas-minor-mode-map (kbd "<tab>") nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (yas-global-mode))

(setq auto-insert-directory "~/.config/emacs/templates/"
      auto-insert-mode t
      auto-insert-query nil
      auto-insert-alist
        '((python-mode . "python.template")
          (sh-mode     . "sh.template")
          (tcl-mode    . "tcl.template")))
(add-hook 'find-file-hook 'auto-insert)

(use-package helpful
  :defer t
  :commands (helpful-callable
             helpful-variable
             helpful-key
             helpful-command
             helpful-at-point
             helpful-function)
  :bind
  ([remap describe-command] . helpful-command)
  ([remap describe-function] . helpful-callable)
  ([remap describe-key] . helpful-key)
  ([remap describe-symbol] . helpful-symbol)
  ([remap describe-variable] . helpful-variable)
  :custom
  (helpful-max-buffers 7))

(use-package copy-as-format
  :ensure t
  :defer t
  :bind
  (("C-c w a" . copy-as-format-asciidoc)
   ("C-c w g" . copy-as-format-github)
   ("C-c w m" . copy-as-format-markdown)
   ("C-c w o" . copy-as-format-org-mode)
   ))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))

(use-package nerd-icons)

(use-package sly
  :config
  (setq inferior-lisp-program "sbcl"))

(use-package yaml-mode)
(use-package typescript-mode
  :config
  (setq typescript-indent-level 2
        typescript-auto-indent-flag t))

(use-package graphql-ts-mode
  :mode ("\\.graphql\\'" "\\.gql\\'")
  :init
  (with-eval-after-load 'treesit
    (add-to-list 'treesit-language-source-alist
                 '(graphql "https://github.com/bkegley/tree-sitter-graphql")))
  )

(use-package js2-mode
  :config
  (setq js2-basic-offset 2))
(use-package json-mode)

(use-package lua-mode
  :ensure t
  :mode "\\.lua\\'"
  :interpreter "lua"
  :config
  (setq lua-indent-level 4)) ; Change indentation depth as preferred

(use-package qml-mode)

(use-package haskell-mode
  :config
  (require 'hs-lint)
  (setq haskell-process-type 'cabal-repl
        haskell-literate 'tex
        haskell-process-suggest-remove-import-lines t
        haskell-stylish-on-save t)
  :hook
  ( ;; (haskell-mode . turn-on-haskell-indentation)
   (haskell-mode . haskell-indentation-mode)
   (haskell-mode . interactive-haskell-mode)
   (haskell-mode . eglot-ensure))
  :bind (:map haskell-mode-map
              ("C-c a c" . haskel-cabal-visit-file)
              ("C-c a i" . haskell-navigate-imports)
              ("C-c a l" . hs-lint)
              ("C-c m" . haskell-compile)
              :map haskell-cabal-mode-map
              ("C-c m" . haskell-compile)))

(use-package lsp-haskell
  :config
  (setq lsp-haskell-server-path "haskell-language-server-wrapper"))
