emacs/.config/emacs/post-init.el

(use-package indent-bars
  :hook
  ((elm-mode . indent-bars-mode))
  :custom
  (indent-bars-no-descend-lists t) ; no extra bars in continued func arg lists
  (indent-bars-treesit-support t)
  (indent-bars-treesit-ignore-blank-lines-types '("module"))
  :config
  (setq
   indent-bars-color '(highlight :face-bg t :blend 0.5)
   indent-bars-pattern "."
   indent-bars-width-frac 0.1
   indent-bars-pad-frac 0.1
   indent-bars-zigzag nil
   indent-bars-color-by-depth nil
   indent-bars-highlight-current-depth nil
   indent-bars-display-on-blank-lines nil)
  )

(use-package elm-mode
  :hook ((elm-mode . eglot-ensure))
  )

(use-package project)

(use-package which-key
  :config
  (which-key-mode))

(use-package dimmer
  :custom (differ-fraction 0.2)
  :custom (dimmer-mode))

;; global revert
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t) ;for dired

;; tabs
(setq backward-delete-char-untabify-method 'hungry
      ;; tab-always-indent 'complete
      )
(setq-default tab-width 2
              indent-tabs-mode nil      ; tab inserts spaces
              electric-indent-inhibit t ;
              )

;; Enabled backups to save your changes to a file intermittently
(setq make-backup-files t
      vc-make-backup-files t
      backup-by-copying t
      org-hide-emphasis-markers t
      frame-inhibit-implied-resize t
      pixel-scroll-precision-mode t
      ;;kill-whole-line t
      custom-file (locate-user-emacs-file "custom.el")
      package-install-upgrade-built-in t
      require-final-newline t
      recentf-max-menu-items 10
      use-dialog-box nil
      project-vc-extra-root-markers '("*.cabal"
                                      ".project")
      x-select-enable-clipboard-manager nil
      kept-old-versions 10
      kept-new-versions 10)
(setq-default use-short-answers t       ;
              truncate-lines t
              case-fold-search nil      ; maybe ...
              fill-column 78            ;
              auto-fill-mode t          ; fill paragraphs to fill-column
              auto-fill-function 'do-auto-fill)

(keymap-global-set "C-x ," 'bury-buffer)
(keymap-global-set "M-g" 'goto-line)
(keymap-global-set "C-x t" 'toggle-truncate-lines)
(keymap-global-set "C-x C-r" 'recentf-open-files)
(keymap-global-set "C-x C-b" 'electric-buffer-list)

(setopt confirm-kill-processes nil)

(put 'narrow-to-region 'disabled nil)
(put 'set-goal-column 'disabled nil)

(use-package sudo-edit)

;;(delete-selection-mode t)
(column-number-mode)
